Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-pluginClinvar.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename" = "builds/3eb90f13e13b17ff0a2c289c5b7054aed4f4228d00399290588afcea87c68692.zip"
        }
    }

  # module.svep[0].module.lambda-pluginConsequence.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.svep[0].module.lambda-pluginConsequence.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/svep-backend-pluginConsequence"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "dev"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all          = {
          + "Environment" = "dev"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.svep[0].module.lambda-pluginConsequence.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-pluginConsequence"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-pluginConsequence.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "svep-backend-pluginConsequence-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-pluginConsequence"
    }

  # module.svep[0].module.lambda-pluginConsequence.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "svep-backend-pluginConsequence-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-pluginConsequence"
    }

  # module.svep[0].module.lambda-pluginConsequence.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Queries VCF for a specified variant."
      + function_name                  = "svep-backend-pluginConsequence"
      + id                             = (known after apply)
      + image_uri                      = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "dev"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "dev"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomad.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-pluginGnomad/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/9695eca273c3f1952134158b212096742626bd4fd9af05eee9ab381d2abe0c3c.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/175/default/svep/lambda/pluginGnomad'"
          + "filename_new"   = "builds/9695eca273c3f1952134158b212096742626bd4fd9af05eee9ab381d2abe0c3c.zip"
          + "filename_old"   = "builds/9695eca273c3f1952134158b212096742626bd4fd9af05eee9ab381d2abe0c3c.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-pluginGnomad"
        }
      + result  = (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomad.aws_iam_policy.additional[0] will be created
  + resource "aws_iam_policy" "additional" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-pluginGnomad"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomad.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-pluginGnomad-logs"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:565393035713:log-group:/aws/lambda/svep-backend-pluginGnomad:*:*",
                          + "arn:aws:logs:*:565393035713:log-group:/aws/lambda/svep-backend-pluginGnomad:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomad.aws_iam_policy_attachment.additional[0] will be created
  + resource "aws_iam_policy_attachment" "additional" {
      + id         = (known after apply)
      + name       = "svep-backend-pluginGnomad"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-pluginGnomad",
        ]
    }

  # module.svep[0].module.lambda-pluginGnomad.aws_iam_policy_attachment.logs[0] will be created
  + resource "aws_iam_policy_attachment" "logs" {
      + id         = (known after apply)
      + name       = "svep-backend-pluginGnomad-logs"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-pluginGnomad",
        ]
    }

  # module.svep[0].module.lambda-pluginGnomad.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-pluginGnomad"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomad.aws_lambda_function.lambda[0] will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Add Gnomad annotations to sVEP result rows."
      + filename                       = (known after apply)
      + function_name                  = "svep-backend-pluginGnomad"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "dev"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                       = {
          + "Environment" = "dev"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-pluginGnomad.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename" = "builds/9695eca273c3f1952134158b212096742626bd4fd9af05eee9ab381d2abe0c3c.zip"
        }
    }

  # module.svep[0].module.lambda-qcFigures.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.svep[0].module.lambda-qcFigures.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/svep-backend-qcFigures"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "dev"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all          = {
          + "Environment" = "dev"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.svep[0].module.lambda-qcFigures.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-qcFigures"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-qcFigures.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "svep-backend-qcFigures-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-qcFigures"
    }

  # module.svep[0].module.lambda-qcFigures.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "svep-backend-qcFigures-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-qcFigures"
    }

  # module.svep[0].module.lambda-qcFigures.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Running vcfstats for generating graphic."
      + function_name                  = "svep-backend-qcFigures"
      + id                             = (known after apply)
      + image_uri                      = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 3000
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "dev"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "dev"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 10240
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-queryGTF.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-queryGTF/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/578165c317f7c01bd33503fe0dcefe3b736b30d73da1e8b027c00df8d899724a.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/175/default/svep/lambda/queryGTF'"
          + "filename_new"   = "builds/578165c317f7c01bd33503fe0dcefe3b736b30d73da1e8b027c00df8d899724a.zip"
          + "filename_old"   = "builds/578165c317f7c01bd33503fe0dcefe3b736b30d73da1e8b027c00df8d899724a.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-queryGTF"
        }
      + result  = (known after apply)
    }

  # module.svep[0].module.lambda-queryGTF.aws_iam_policy.additional[0] will be created
  + resource "aws_iam_policy" "additional" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-queryGTF"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep[0].module.lambda-queryGTF.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-queryGTF-logs"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:565393035713:log-group:/aws/lambda/svep-backend-queryGTF:*:*",
                          + "arn:aws:logs:*:565393035713:log-group:/aws/lambda/svep-backend-queryGTF:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep[0].module.lambda-queryGTF.aws_iam_policy_attachment.additional[0] will be created
  + resource "aws_iam_policy_attachment" "additional" {
      + id         = (known after apply)
      + name       = "svep-backend-queryGTF"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-queryGTF",
        ]
    }

  # module.svep[0].module.lambda-queryGTF.aws_iam_policy_attachment.logs[0] will be created
  + resource "aws_iam_policy_attachment" "logs" {
      + id         = (known after apply)
      + name       = "svep-backend-queryGTF-logs"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-queryGTF",
        ]
    }

  # module.svep[0].module.lambda-queryGTF.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-queryGTF"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-queryGTF.aws_lambda_function.lambda[0] will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Queries GTF for a specified VCF regions."
      + filename                       = (known after apply)
      + function_name                  = "svep-backend-queryGTF"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "dev"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                       = {
          + "Environment" = "dev"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + timeout                        = 24
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-queryGTF.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename" = "builds/578165c317f7c01bd33503fe0dcefe3b736b30d73da1e8b027c00df8d899724a.zip"
        }
    }

  # module.svep[0].module.lambda-queryVCF.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-queryVCF/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/731476854ca629ef91e08d1431189dae079603bc23960cc831b46d10fecc3dc1.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/175/default/svep/lambda/queryVCF'"
          + "filename_new"   = "builds/731476854ca629ef91e08d1431189dae079603bc23960cc831b46d10fecc3dc1.zip"
          + "filename_old"   = "builds/731476854ca629ef91e08d1431189dae079603bc23960cc831b46d10fecc3dc1.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-queryVCF"
        }
      + result  = (known after apply)
    }

  # module.svep[0].module.lambda-queryVCF.aws_iam_policy.additional[0] will be created
  + resource "aws_iam_policy" "additional" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-queryVCF"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep[0].module.lambda-queryVCF.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-queryVCF-logs"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:565393035713:log-group:/aws/lambda/svep-backend-queryVCF:*:*",
                          + "arn:aws:logs:*:565393035713:log-group:/aws/lambda/svep-backend-queryVCF:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep[0].module.lambda-queryVCF.aws_iam_policy_attachment.additional[0] will be created
  + resource "aws_iam_policy_attachment" "additional" {
      + id         = (known after apply)
      + name       = "svep-backend-queryVCF"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-queryVCF",
        ]
    }

  # module.svep[0].module.lambda-queryVCF.aws_iam_policy_attachment.logs[0] will be created
  + resource "aws_iam_policy_attachment" "logs" {
      + id         = (known after apply)
      + name       = "svep-backend-queryVCF-logs"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-queryVCF",
        ]
    }

  # module.svep[0].module.lambda-queryVCF.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-queryVCF"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-queryVCF.aws_lambda_function.lambda[0] will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Invokes queryGTF for each region."
      + filename                       = (known after apply)
      + function_name                  = "svep-backend-queryVCF"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "dev"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                       = {
          + "Environment" = "dev"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + timeout                        = 28
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-queryVCF.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename" = "builds/731476854ca629ef91e08d1431189dae079603bc23960cc831b46d10fecc3dc1.zip"
        }
    }

  # module.svep[0].module.lambda-queryVCFsubmit.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-queryVCFsubmit/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/4e51b58c352ee156ae72a587687bb67b259c4427541d678cbd8ec2e43c7c8cbf.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/175/default/svep/lambda/queryVCFsubmit'"
          + "filename_new"   = "builds/4e51b58c352ee156ae72a587687bb67b259c4427541d678cbd8ec2e43c7c8cbf.zip"
          + "filename_old"   = "builds/4e51b58c352ee156ae72a587687bb67b259c4427541d678cbd8ec2e43c7c8cbf.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-queryVCFsubmit"
        }
      + result  = (known after apply)
    }

  # module.svep[0].module.lambda-queryVCFsubmit.aws_iam_policy.additional[0] will be created
  + resource "aws_iam_policy" "additional" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-queryVCFsubmit"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep[0].module.lambda-queryVCFsubmit.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-queryVCFsubmit-logs"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:565393035713:log-group:/aws/lambda/svep-backend-queryVCFsubmit:*:*",
                          + "arn:aws:logs:*:565393035713:log-group:/aws/lambda/svep-backend-queryVCFsubmit:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep[0].module.lambda-queryVCFsubmit.aws_iam_policy_attachment.additional[0] will be created
  + resource "aws_iam_policy_attachment" "additional" {
      + id         = (known after apply)
      + name       = "svep-backend-queryVCFsubmit"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-queryVCFsubmit",
        ]
    }

  # module.svep[0].module.lambda-queryVCFsubmit.aws_iam_policy_attachment.logs[0] will be created
  + resource "aws_iam_policy_attachment" "logs" {
      + id         = (known after apply)
      + name       = "svep-backend-queryVCFsubmit-logs"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-queryVCFsubmit",
        ]
    }

  # module.svep[0].module.lambda-queryVCFsubmit.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-queryVCFsubmit"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-queryVCFsubmit.aws_lambda_function.lambda[0] will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "This lambda will be called if there are too many batchids to be processed within"
      + filename                       = (known after apply)
      + function_name                  = "svep-backend-queryVCFsubmit"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "dev"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                       = {
          + "Environment" = "dev"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + timeout                        = 28
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-queryVCFsubmit.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename" = "builds/4e51b58c352ee156ae72a587687bb67b259c4427541d678cbd8ec2e43c7c8cbf.zip"
        }
    }

  # module.svep[0].module.lambda-sendJobEmail.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-sendJobEmail/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/e3adc49d45d297cacc8d974bb7e104e68d128cd412c4ccaee9839be0e41c2168.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/175/default/svep/lambda/sendJobEmail'"
          + "filename_new"   = "builds/e3adc49d45d297cacc8d974bb7e104e68d128cd412c4ccaee9839be0e41c2168.zip"
          + "filename_old"   = "builds/e3adc49d45d297cacc8d974bb7e104e68d128cd412c4ccaee9839be0e41c2168.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-sendJobEmail"
        }
      + result  = (known after apply)
    }

  # module.svep[0].module.lambda-sendJobEmail.aws_iam_policy.additional[0] will be created
  + resource "aws_iam_policy" "additional" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-sendJobEmail"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep[0].module.lambda-sendJobEmail.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "svep-backend-sendJobEmail-logs"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:565393035713:log-group:/aws/lambda/svep-backend-sendJobEmail:*:*",
                          + "arn:aws:logs:*:565393035713:log-group:/aws/lambda/svep-backend-sendJobEmail:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.svep[0].module.lambda-sendJobEmail.aws_iam_policy_attachment.additional[0] will be created
  + resource "aws_iam_policy_attachment" "additional" {
      + id         = (known after apply)
      + name       = "svep-backend-sendJobEmail"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-sendJobEmail",
        ]
    }

  # module.svep[0].module.lambda-sendJobEmail.aws_iam_policy_attachment.logs[0] will be created
  + resource "aws_iam_policy_attachment" "logs" {
      + id         = (known after apply)
      + name       = "svep-backend-sendJobEmail-logs"
      + policy_arn = (known after apply)
      + roles      = [
          + "svep-backend-sendJobEmail",
        ]
    }

  # module.svep[0].module.lambda-sendJobEmail.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-sendJobEmail"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-sendJobEmail.aws_lambda_function.lambda[0] will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Invokes sendJobEmail to send email to user"
      + filename                       = (known after apply)
      + function_name                  = "svep-backend-sendJobEmail"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1792
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "dev"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                       = {
          + "Environment" = "dev"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + timeout                        = 28
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-sendJobEmail.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename" = "builds/e3adc49d45d297cacc8d974bb7e104e68d128cd412c4ccaee9839be0e41c2168.zip"
        }
    }

  # module.svep[0].module.lambda-updateReferenceFiles.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.svep[0].module.lambda-updateReferenceFiles.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/svep-backend-updateReferenceFiles"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "dev"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all          = {
          + "Environment" = "dev"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.svep[0].module.lambda-updateReferenceFiles.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "svep-backend-updateReferenceFiles"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "NAME"        = "svep-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.svep[0].module.lambda-updateReferenceFiles.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "svep-backend-updateReferenceFiles-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-updateReferenceFiles"
    }

  # module.svep[0].module.lambda-updateReferenceFiles.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "svep-backend-updateReferenceFiles-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "svep-backend-updateReferenceFiles"
    }

  # module.svep[0].module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Retrieves latest reference files and updates the reference bucket in S3"
      + filename                       = "builds/bb8f7a09d6e29293e5fba614957723d3e1fdd6399084cc9827324091f4bc094c.zip"
      + function_name                  = "svep-backend-updateReferenceFiles"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "dev"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "dev"
          + "NAME"                  = "svep-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 8192
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.svep[0].module.lambda-updateReferenceFiles.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/lambda/updateReferenceFiles",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/bb8f7a09d6e29293e5fba614957723d3e1fdd6399084cc9827324091f4bc094c.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/bb8f7a09d6e29293e5fba614957723d3e1fdd6399084cc9827324091f4bc094c.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.lambda-updateReferenceFiles.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/bb8f7a09d6e29293e5fba614957723d3e1fdd6399084cc9827324091f4bc094c.zip"
          + "timestamp" = "1748236580946966800"
        }
    }

  # module.svep[0].module.python_modules_layer.aws_lambda_layer_version.this[0] will be created
  + resource "aws_lambda_layer_version" "this" {
      + arn                         = (known after apply)
      + code_sha256                 = (known after apply)
      + compatible_runtimes         = [
          + "python3.12",
        ]
      + created_date                = (known after apply)
      + description                 = "python libraries"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "svep_backend_python_modules_layer"
      + s3_bucket                   = (known after apply)
      + s3_key                      = "builds/a5e35243eb9ad52dfad9c3cef99de0bd47136a32764bdd6247779fac74671433.zip"
      + s3_object_version           = (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = (known after apply)
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.svep[0].module.python_modules_layer.aws_s3_object.lambda_package[0] will be created
  + resource "aws_s3_object" "lambda_package" {
      + acl                    = "private"
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "builds/a5e35243eb9ad52dfad9c3cef99de0bd47136a32764bdd6247779fac74671433.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "builds/a5e35243eb9ad52dfad9c3cef99de0bd47136a32764bdd6247779fac74671433.zip"
      + storage_class          = "ONEZONE_IA"
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.svep[0].module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/a5e35243eb9ad52dfad9c3cef99de0bd47136a32764bdd6247779fac74671433.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/a5e35243eb9ad52dfad9c3cef99de0bd47136a32764bdd6247779fac74671433.plan.json"
      + id                   = (known after apply)
    }

  # module.svep[0].module.python_modules_layer.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/a5e35243eb9ad52dfad9c3cef99de0bd47136a32764bdd6247779fac74671433.zip"
          + "timestamp" = "1748236581090882000"
        }
    }

Plan: 1096 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + admin_login_command  = (known after apply)
  + api_url              = (known after apply)
  + beacon_ui_url        = (known after apply)
  + cognito_client_id    = (known after apply)
  + cognito_user_pool_id = (known after apply)
  + guest_login_command  = (known after apply)
module.svep[0].null_resource.init_script: Creating...
module.sbeacon.null_resource.init_script: Creating...
module.svep[0].null_resource.init_script: Provisioning with 'local-exec'...
module.sbeacon.null_resource.init_script: Provisioning with 'local-exec'...
module.svep[0].null_resource.init_script (local-exec): Executing: ["/bin/sh" "-c" "bash init.sh"]
module.sbeacon.null_resource.init_script (local-exec): Executing: ["/bin/sh" "-c" "bash init.sh"]
module.sbeacon.module.lambda-getAnalyses.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-getFilteringTerms.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-getFilteringTerms.local_file.archive_plan[0]: Creation complete after 0s [id=88fa436c4c397cbad41be2744c91f1d0665a895b]
module.sbeacon.null_resource.init_script (local-exec): Running init.sh in sbeacon
module.sbeacon.module.lambda-getAnalyses.local_file.archive_plan[0]: Creation complete after 0s [id=7dcd38d3dc4bf5078c57a3709a0add20ec58ed1c]
module.sbeacon.module.lambda-deidentifyFiles.local_file.archive_plan[0]: Creating...
module.svep[0].null_resource.init_script (local-exec): Running init.sh in sbeacon
module.sbeacon.module.lambda-getEntryTypes.local_file.archive_plan[0]: Creating...
module.sbeacon.module.lambda-deidentifyFiles.local_file.archive_plan[0]: Creation complete after 0s [id=613be1c9511a739edaf2ddbdd283b2409cedd42d]
module.sbeacon.null_resource.init_script (local-exec): + REPOSITORY_DIRECTORY=/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/175/default/sbeacon
module.sbeacon.null_resource.init_script (local-exec): + LIBRARIES=/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/175/default/sbeacon/libraries
module.sbeacon.null_resource.init_script (local-exec): + SOURCE=/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/175/default/sbeacon/libraries/source
module.sbeacon.null_resource.init_script (local-exec): + '[' -d /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/175/default/sbeacon/libraries ']'
module.sbeacon.null_resource.init_script (local-exec): + rm -rf /home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/175/default/sbeacon/libraries
module.svep[0].null_resource.init_script (local-exec): + REPOSITORY_DIRECTORY=/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/175/default/sbeacon
module.svep[0].null_resource.init_script (local-exec): + LIBRARIES=/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/175/default/sbeacon/librarie
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.